<?php 
$r = array();
$total = array();
$r['img']="DSC_2158.jpg";
$r['name']="ดอยม่อนแจ่ม";
$r['detail']="ม่อมแจ่ม  ตั้งอยู่บนสันเขาบริเวณหมู่บ้านม้งหนองหอย อำเภอแม่ริม อยู่ห่างจากตัวเมืองเชียงใหม่ประมาณ 40 นาที  เดิมที่บริเวณนี้ชาวบ้านเรียกว่ากิ่วเสือเป็นป่ารกร้าง ต่อมาชาวบ้านเข้ามาแผ้วถางและปลูกผิ่น จนในท้ายที่สุดโครงการหลวงมาขอซื้อพื้นที่เข้าโครงการหลวงหนองหอย   เมื่อเข้าเป็นส่วนหนึ่งของโครงการหลวง คุณแจ่ม-แจ่มจรัส สุชีวะ หลานตาของ ม.จ. ภีศเดช รัชนี ประธานมูลนิธิโครงการหลวง ได้เข้ามาพัฒนาและปรับปรุงบริเวณม่อนแจ่มให้กลายเป็นสถานที่ท่องเที่ยวโดยเฉพาะในลักษณะของม่อนแจ่มแค้มปิ้งรีสอร์ท ซึ่งม่อนแจ่มเพิ่งจะเปิดตัวอย่างเป็นทางการ เมื่อเดือน พ.ย. 2552
ม่อนแจ่มมีอากาศเย็นสบายตลอดปี มีหมอกยามเช้า ช่วงที่เหมาะสำหรับท่องเที่ยวคือ เดือนตุลาคม -กุมภาพันธ์  มีจุดชมวิวสามารถมองเห็นวิวทิวทัศน์ทิวภูเขาสลับกันไกลสุดลูกหูลูกตา อีกด้านเป็นแปลงปลูกพืชและไม้เมืองหนาวของโครงการหลวง 
ยอดเขาทางทิศตะวันออกมีจุดชมวิวม่อนล่อง เหมาะสำหรับชมทิวทัศน์ของพื้นที่โครงการหลวง เป็นจุดชมทะเลหมอกบนหน้าผา มองเห็นทิวทัศน์ได้กว้างไกล ชมพรรณไม้และดอกไม้ป่า เส้นทางขึ้นไม่ได้ลาดยางหรือเทปูน เป็นทางดินลูกรัง ควรใช้รถขับเคลื่อนสี่ล้อ
ทางด้านทิศใต้เป็นไหล่เขามองลงไปจะเห็นหมู่บ้านม้งหนองหอยและพื้นที่ศูนย์พัฒนาโครงการหลวงหนองหอยโดยรอบ ซึ่งเป็นแปลงปลูกผักและวิจัยพืชผักเมืองหนาว เช่น อาติโช๊ค แปลงสมุนไพรเลมอนทาร์ม มิ้น คาร์โมมายด์ โรสแมรี่ ไม้ผล เช่น พลัม องุ่นไร้เมล็ด สตรอเบอรี่พันธุ์ 80 แปลงผักไฮโดรโพนิค การปลูกพืชโดยไม่ใช้ดิน เช่น โอ้คลีฟแดง และผักตระกูลสลัด มะเขือเทศดอยคำ ฯลฯ";
$a['img']="yai_3525.jpg";
$a['name']="พระบรมธาตุดอยสุเทพ";
$a['detail']="พระบรมธาตุดอยสุเทพ: เป็นปูชนียสถานที่สำคัญยิ่งของเมืองเชียงใหม่ ประดิษฐานอยู่บนดอยสุเทพ สูงจากระดับน้ำทะเล 1000 เมตร ตั้งอยู่ทางด้านทิศตะวันตกของตัวเมือง ห่างจากตัวเมืองเก่าประมาณ 10 กิโลเมตร สามารถมองเห็นจากตัวเมืองได้ชัดเจน และเมื่อขึ้นไปอยู่ที่พระบรมธาตุ ก็จะเห็นตัวเมืองเชียงใหม่ได้ทั้งหมด มีบันไดนาคเจ็ดเศียรทอดจากทางขึ้นไปถึงซุ้มประตูวัด จำนวน 300 ขั้น องค์พระบรมธาตุสร้างขึ้นเมื่อปี พ.ศ. 1916 โดยพระเจ้ากือนา กษรัตริย์องค์ที่ 6 ของราชวงค์เม็งราย เพื่อบรรจุบรรจุพระบรมสารีริกธาตุส่วนพระเศียรของพระพุทธเจ้า ต่อมาครูบาศรีวิชัยได้บอกบุญชักชวนชาวเหนือ ให้ช่วยกันสร้างถนนจากเชิงดอยไปจนถึงยอดดอย ณ ที่ตั้งพระบรมธาตุ องค์พระบรมธาตุประดิษฐานอยู่ใต้ดินลึกลงไป 8 ศอก ดังนั้นจึงห้ามมิให้สตรีเข้าไปภายในฐานเจดีย์ และก่อนที่จะเข้าสู่ภายในบริเวณองค์พระบรมธาตุ ต้องถอดรองเท้าไว้ที่เชิงบันไดเสียก่อน ในวันวิสาขบูชาของทุกปี หรือวันเพ็ญเดือน 6 จะมีประเพณีการเดินขึ้นดอยสุเทพเป็นประจำ เพื่อนมัสการพระธาตุดอยสุเทพถือเป็นสิริมงคลและได้กุศลแรง";
$b['img']="21.jpg";
$b['name']="ถนนคนเดินท่าแพ";
$b['detail']="ถนนคนเดินท่าแพ: เป็นสถานที่ชอปปิ้งสุดฮิตของเมืองเชียงใหม่ เปิดบริการทุกวันเสาร์-อาทิตย์ ภายในคูเมืองบริเวณถนนราชดำเนิน โดยเริ่มจากประตูท่าแพไปจนถึงสามแยกถนนสามล้าน เป็นการจัดแผงขายสินค้าบริเวณสองฝั่งถนน สินค้าที่นำออกมาวางขายมีมากมายทั้งสินค้าพื้นเมือง สินค้า OTOP และอีกมากมายหลายอย่าง นับว่าเป็นสีสันของการท่องเที่ยวในตัวเมืองเชียงใหม่ ทำให้นักท่องเที่ยวได้สัมผัสถึงบรรยากาศแบบเมืองเหนือเพราะภายในคูเมืองยัง คงรักษาเอกลักษณ์ของบ้านเรือนโบราณไว้เป็นอย่างดี ถ้าไปเชียงใหม่คราวนี้แนะนำว่าให้ไปตรงช่วงวันหยุดเสาร์-อาทิตย์";
$total[]=$r;
$total[]=$a;
$total[]=$b;
echo json_encode($total);